In [94]:
df = pd.DataFrame({'col1': [1, 2], 'col2': [3, 4]})
print(df.corr())
print(df.cov())

      col1  col2
col1   1.0   1.0
col2   1.0   1.0
      col1  col2
col1   0.5   0.5
col2   0.5   0.5

In [1]:
import numpy.random as rnd 
rnd.seed(1)

In [2]:
# rnd.uniform(low=0.0, high=1.0, size=None) 
# rnd.rand(shape) # Same as uniform(0.0, 1.0, None) 
# rnd.randint(low, high=None, size=None) 
# rnd.normal(loc=0.0, scale=1.0, size=None) 
# rnd.randn(shape) # Same as normal(0.0, 1.0, shape) 
# rnd.binomial(n, p, size=None)

In [3]:
import pandas as pd

alco = pd.read_csv("alco2009.csv").fillna(method='ffill').reset_index().set_index(['State','Year']).drop(['index'], axis=1)

In [5]:
alco.head()

              Beer  Wine  Spirits
State   Year
Alabama 2009  1.20  0.22     0.58
        2008  1.24  0.22     0.58
        2007  1.24  0.22     0.56
        2006  1.22  0.21     0.55
        2005  1.18  0.20     0.53

In [85]:
alco.loc[('New York',2009)]

Beer       0.91
Wine       0.46
Spirits    0.69
Name: (New York, 2009), dtype: float64

In [4]:
beer_seriesNY = alco.loc['New York']['Beer']
beer_seriesCA = alco.loc['California']['Beer']
beer_seriesNY.corr(beer_seriesCA)

0.9709778539165477

In [7]:
beer_seriesCA.cov(beer_seriesNY)

0.01743816287878787

In [8]:
[x.skew() for x in (beer_seriesCA, beer_seriesNY)]

[0.16457291292976317, 0.32838100586311286]

In [6]:
frameNY = alco.loc['New York'] 
frameNY.skew()

Beer       0.328381
Wine       0.127308
Spirits    0.656699
dtype: float64

In [7]:
frameNY.corr() # all pairwise correlations

             Beer      Wine   Spirits
Beer     1.000000  0.470690  0.908969
Wine     0.470690  1.000000  0.611923
Spirits  0.908969  0.611923  1.000000

In [8]:
frameNY.cov() # all pairwise covariances

             Beer      Wine   Spirits
Beer     0.016103  0.002872  0.026020
Wine     0.002872  0.002312  0.006638
Spirits  0.026020  0.006638  0.050888

In [9]:
pop = pd.read_csv("population.csv").set_index('State')
pop.head()

,2010,2009,2008,2007,2006,2005,2004,2003,2002,2001,2000
State,,,,,,,,,,,
Alabama,4729656,4707496,4673889,4634063,4594911,4542912,4510588,4489876,4471462,4463343,4451497
Alaska,708862,694690,685532,679893,675322,667114,659305,647671,641974,633538,627748
Arizona,6676627,6587653,6499207,6360238,6190987,5973970,5758692,5590820,5451472,5303869,5166304
Arkansas,2910236,2887331,2867099,2841595,2814910,2776257,2746215,2722804,2704471,2690743,2678115
California,37266600,36887615,36538008,36185908,35947461,35770688,35538256,35236589,34867773,34481753,33994383

In [10]:
# Remove the last two lines: they contain future estimates
# pop_seriesNY = pop.ix["New York"][:-2]
pop_seriesNY = pop.loc["New York"]
pop_seriesNY.head()

2010    19577730
2009    19522612
2008    19464482
2007    19419540
2006    19353588
Name: New York, dtype: int64

In [46]:
type(pop_seriesNY)

pandas.core.series.Series

In [21]:
pop_year_index_ny = pop_seriesNY.to_frame()
pop_year_index_ny

      New York
2010  19577730
2009  19522612
2008  19464482
2007  19419540
2006  19353588
2005  19329398
2004  19297907
2003  19235015
2002  19161568
2001  19087486
2000  18996959

In [30]:
frameNY.columns

Index(['Beer', 'Wine', 'Spirits'], dtype='object')

In [42]:
# Convert the index from date to integer year
pop_seriesNY.index = pop_seriesNY.index.str.split().str[-1].astype(int)
# frameNY.ix[2000:2009].corrwith(pop_seriesNY)

print(pop_seriesNY.index)
print(frameNY.index)

Int64Index([2010, 2009, 2008, 2007, 2006, 2005, 2004, 2003, 2002, 2001, 2000], dtype='int64')
Int64Index([2009, 2008, 2007, 2006, 2005, 2004, 2003, 2002, 2001, 2000, 1999,
            1998, 1997, 1996, 1995, 1994, 1993, 1992, 1991, 1990, 1989, 1988,
            1987, 1986, 1985, 1984, 1983, 1982, 1981, 1980, 1979, 1978, 1977],
           dtype='int64', name='Year')

In [47]:
frameNY.corrwith(pop_seriesNY)

Beer      -0.523108
Wine       0.937146
Spirits    0.956595
dtype: float64

In [39]:
import numpy as np
x = pd.DataFrame(np.random.randn(5,3),columns=['A','B','C'])
# y = pd.DataFrame(np.random.randn(5,3),columns=['A','B','C'])
y = pd.Series(np.random.randn(5))
# x1 = pd.DataFrame(x.ix[:,0])
print(x.index)
print(y.index)
x.corrwith(y)

RangeIndex(start=0, stop=5, step=1)
RangeIndex(start=0, stop=5, step=1)

A    0.111382
B   -0.566170
C    0.360060
dtype: float64

In [65]:
from scipy.stats import pearsonr

# Manually align the indexes
pop_sorted = pop_seriesNY.sort_index()[:-1]
pop_sorted

2000    18996959
2001    19087486
2002    19161568
2003    19235015
2004    19297907
2005    19329398
2006    19353588
2007    19419540
2008    19464482
2009    19522612
Name: New York, dtype: int64

In [70]:
alco_10 = alco.loc['New York'][:10]
alco_10

      Beer  Wine  Spirits
Year
2009  0.91  0.46     0.69
2008  0.92  0.47     0.67
2007  0.92  0.46     0.68
2006  0.88  0.45     0.65
2005  0.90  0.43     0.64
2004  0.91  0.41     0.62
2003  0.93  0.40     0.61
2002  0.95  0.38     0.59
2001  0.96  0.37     0.56
2000  0.92  0.38     0.58

In [71]:
# List comprehension to calculate all correlations and p-values 
corrs = [(bev,) + pearsonr(alco_10[bev], pop_sorted) for bev in alco_10.columns]
corrs

[('Beer', 0.4611330193379027, 0.17978962070053112),
 ('Wine', -0.934539787083709, 7.419209532026103e-05),
 ('Spirits', -0.9538330927232627, 1.879470263011385e-05)]

In [72]:
# Convert the list to a frame
pd.DataFrame(corrs, columns=("bev", "r", "p-value")).set_index("bev")

                r   p-value
bev
Beer     0.461133  0.179790
Wine    -0.934540  0.000074
Spirits -0.953833  0.000019